data/increasing-clients/1-replicas/11-clients/1-trial/producer.txt
2018-11-27 03:53:01, 355261 records sent, 71052.2 records/sec (34.69 MB/sec), 706.0 ms avg latency, 893.0 max latency.
2018-11-27 03:53:06, 395250 records sent, 79050.0 records/sec (38.60 MB/sec), 795.6 ms avg latency, 854.0 max latency.
2018-11-27 03:53:11, 389205 records sent, 77701.1 records/sec (37.94 MB/sec), 813.3 ms avg latency, 856.0 max latency.
2018-11-27 03:53:16, 343542 records sent, 68708.4 records/sec (33.55 MB/sec), 930.2 ms avg latency, 1543.0 max latency.
2018-11-27 03:53:23, 191735 records sent, 29781.8 records/sec (14.54 MB/sec), 800.1 ms avg latency, 4826.0 max latency.
2018-11-27 03:53:28, 407185 records sent, 81437.0 records/sec (39.76 MB/sec), 1406.5 ms avg latency, 4828.0 max latency.
2018-11-27 03:53:33, 404922 records sent, 80984.4 records/sec (39.54 MB/sec), 787.3 ms avg latency, 831.0 max latency.
2018-11-27 03:53:38, 406193 records sent, 81238.6 records/sec (39.67 MB/sec), 780.9 ms avg latency, 837.0 max latency.
2018-11-27 03:53:43, 404984 records sent, 80996.8 records/sec (39.55 MB/sec), 782.6 ms avg latency, 834.0 max latency.
2018-11-27 03:53:48, 397017 records sent, 79403.4 records/sec (38.77 MB/sec), 799.6 ms avg latency, 853.0 max latency.
2018-11-27 03:53:53, 427862 records sent, 85572.4 records/sec (41.78 MB/sec), 744.2 ms avg latency, 827.0 max latency.
2018-11-27 03:53:58, 181257 records sent, 36251.4 records/sec (17.70 MB/sec), 1747.6 ms avg latency, 3519.0 max latency.
2018-11-27 03:54:03, 339357 records sent, 67871.4 records/sec (33.14 MB/sec), 934.5 ms avg latency, 1697.0 max latency.
2018-11-27 03:54:08, 404891 records sent, 80978.2 records/sec (39.54 MB/sec), 787.9 ms avg latency, 855.0 max latency.
2018-11-27 03:54:13, 403000 records sent, 80600.0 records/sec (39.36 MB/sec), 782.7 ms avg latency, 821.0 max latency.
2018-11-27 03:54:18, 413664 records sent, 82732.8 records/sec (40.40 MB/sec), 770.1 ms avg latency, 832.0 max latency.
2018-11-27 03:54:23, 409975 records sent, 81995.0 records/sec (40.04 MB/sec), 778.5 ms avg latency, 807.0 max latency.
2018-11-27 03:54:28, 413571 records sent, 82714.2 records/sec (40.39 MB/sec), 767.2 ms avg latency, 828.0 max latency.
2018-11-27 03:54:33, 414191 records sent, 82838.2 records/sec (40.45 MB/sec), 764.1 ms avg latency, 836.0 max latency.
2018-11-27 03:54:38, 405108 records sent, 81021.6 records/sec (39.56 MB/sec), 781.9 ms avg latency, 830.0 max latency.
2018-11-27 03:54:43, 403744 records sent, 80748.8 records/sec (39.43 MB/sec), 786.9 ms avg latency, 828.0 max latency.
2018-11-27 03:54:51, 417632 records sent, 49243.2 records/sec (24.04 MB/sec), 753.2 ms avg latency, 4294.0 max latency.
2018-11-27 03:54:56, 411835 records sent, 82367.0 records/sec (40.22 MB/sec), 1314.9 ms avg latency, 4296.0 max latency.
2018-11-27 03:55:01, 418810 records sent, 83762.0 records/sec (40.90 MB/sec), 762.7 ms avg latency, 799.0 max latency.
2018-11-27 03:55:06, 421073 records sent, 84214.6 records/sec (41.12 MB/sec), 743.1 ms avg latency, 818.0 max latency.
2018-11-27 03:55:11, 421321 records sent, 84264.2 records/sec (41.14 MB/sec), 759.5 ms avg latency, 848.0 max latency.
2018-11-27 03:55:16, 419481 records sent, 83896.2 records/sec (40.96 MB/sec), 758.6 ms avg latency, 804.0 max latency.
2018-11-27 03:55:21, 426416 records sent, 85283.2 records/sec (41.64 MB/sec), 747.4 ms avg latency, 783.0 max latency.
2018-11-27 03:55:26, 416082 records sent, 83216.4 records/sec (40.63 MB/sec), 755.9 ms avg latency, 813.0 max latency.
2018-11-27 03:55:31, 413540 records sent, 82708.0 records/sec (40.38 MB/sec), 772.4 ms avg latency, 815.0 max latency.
2018-11-27 03:55:36, 412672 records sent, 82534.4 records/sec (40.30 MB/sec), 766.2 ms avg latency, 813.0 max latency.
2018-11-27 03:55:41, 420701 records sent, 84140.2 records/sec (41.08 MB/sec), 761.1 ms avg latency, 802.0 max latency.
2018-11-27 03:55:46, 415896 records sent, 83179.2 records/sec (40.61 MB/sec), 755.4 ms avg latency, 815.0 max latency.
2018-11-27 03:55:51, 416950 records sent, 83390.0 records/sec (40.72 MB/sec), 765.4 ms avg latency, 816.0 max latency.
2018-11-27 03:55:56, 416516 records sent, 83303.2 records/sec (40.68 MB/sec), 762.1 ms avg latency, 803.0 max latency.
2018-11-27 03:56:01, 419461 records sent, 83892.2 records/sec (40.96 MB/sec), 753.3 ms avg latency, 814.0 max latency.
2018-11-27 03:56:06, 427428 records sent, 85485.6 records/sec (41.74 MB/sec), 742.3 ms avg latency, 803.0 max latency.
2018-11-27 03:56:11, 425940 records sent, 85188.0 records/sec (41.60 MB/sec), 747.1 ms avg latency, 821.0 max latency.
2018-11-27 03:56:16, 412517 records sent, 82453.9 records/sec (40.26 MB/sec), 764.1 ms avg latency, 832.0 max latency.
2018-11-27 03:56:21, 419523 records sent, 83904.6 records/sec (40.97 MB/sec), 758.5 ms avg latency, 807.0 max latency.
2018-11-27 03:56:26, 406472 records sent, 81294.4 records/sec (39.69 MB/sec), 784.8 ms avg latency, 831.0 max latency.
2018-11-27 03:56:31, 405759 records sent, 81151.8 records/sec (39.62 MB/sec), 783.1 ms avg latency, 826.0 max latency.
2018-11-27 03:56:36, 435426 records sent, 87085.2 records/sec (42.52 MB/sec), 727.8 ms avg latency, 820.0 max latency.
2018-11-27 03:56:41, 413137 records sent, 82627.4 records/sec (40.35 MB/sec), 767.6 ms avg latency, 806.0 max latency.
2018-11-27 03:56:42, 17578125 records sent, 77918.602280 records/sec (38.05 MB/sec), 810.80 ms avg latency, 4828.00 ms max latency, 776 ms 50th, 832 ms 95th, 3480 ms 99th, 4814 ms 99.9th.